[[["90dcaa29-68f1-4fd2-85ce-9cf64d2d3fb4",{"pageContent":"\"Course syllabus\\nOm kursen\\n\\nKursen genomförs som en självstudiekurs med inlämningar och kommunikation i Canvas. Vid behov kan möten, fysiska eller via  ZOOM planeras.\\n\\nFör att bli godkänd på kursen skall du ha gjort och lämnat in alla inlämningar i tid och under kurstillfället. Inlämningarna skall följa de anvisningar som finns i uppgifterna.\\n\\nDet jobb du utformar ditt ansökningsbrev, CV och E-portfolio för skall vara ett kvalificerat ingenjörsjobb inom IT lämpligt för någon som kommit en bra bit in i sin utbildning mot en kandidatexamen. Ansökan skall skrivas för ett nytt jobb - du kan inte återanvända en gammal ansökan för något du sökt tidigare.\\n\\nKvaliteten på det du  lämnar in skall vara sådan att du med relativt stor sannolikhet skulle kunna bli utvald för att få komma på intervju när du söker ett kvalificerat ingenjörsjobb inom IT. Om vi bedömer att kvaliteten inte riktigt räcker får du feedback och en chans att komplettera.\\n\\nOm den feedback ni får\\n\\nNågot som är lite speciellt i kursen är att du kommer att få rak och ärlig feedback på något som kan uppfattas som mycket personligt. Att ge sådan feedback är ofta en inte helt enkel balansgång och aldrig menat som något riktat mot dig som person. Avsikten är alltid att försöka hjälpa er att förbättra era ansökningshandlingar och att hjälpa er att få ett annat perspektiv på det ni gör i kursen som kan vara svårt att se själv.\\n\\nÄven om den feedback ni får ibland kan kännas som hård så ges all feedback  i akt","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_syllabus.txt","loc":{"lines":{"from":1,"to":1}}}}],["177873fa-8c3f-4ddd-938d-bd4ab50b2822",{"pageContent":"något riktat mot dig som person. Avsikten är alltid att försöka hjälpa er att förbättra era ansökningshandlingar och att hjälpa er att få ett annat perspektiv på det ni gör i kursen som kan vara svårt att se själv.\\n\\nÄven om den feedback ni får ibland kan kännas som hård så ges all feedback  i akt och mening att hjälpa er att kunna förbättra era chanser att kunna få komma på en intervju för era kexjobb och era framtida drömjobb!\"","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_syllabus.txt","loc":{"lines":{"from":1,"to":1}}}}]],{"0":"90dcaa29-68f1-4fd2-85ce-9cf64d2d3fb4","1":"177873fa-8c3f-4ddd-938d-bd4ab50b2822"}]