[[["7463e62f-a160-45aa-94f9-1e6527d2b7e0",{"pageContent":"\"Aktiv karriärstart – CV\\nNew Attempt\\nDue 14 Feb by 19:00 Points 1 Submitting a file upload File types pdf\\nOm uppgiften\\n\\nOBS! Gör klart/lämna in självinventeringen först innan du lämnar in ditt brev och CV - självinventeringen ska ligga till grund för brev och CV! I Självinventeringen finns också uppgifter där ni ska kamratgranska varandras brev och CV.\\nDu ska också ha läst igenom alla instruktioner för uppgiften. Genom att lämna in uppgiften intygar du också att du läst dem.\\n\\nI det här skedet av kursen skall du skriva ett ansökningsbrev (ansökningsbrevet lämnar du in i en annan inlämning) och CV  riktat mot en tjänst som kräver att man läst minst två år på en utbildning liknande det program du läser på KTH.\\n\\nSteg ett är att du hittar en annons på webben för en sådan tjänst som ligger inom området för din utbildning som du skulle kunna tänka dig att söka. Skriv sedan ett ansökningsbrev och CV utformat för att söka tjänsten. Utgå från vad du gjort i din självinventering och de tips för hur du utformar ditt CV du hittar i övningshäftet. Det finns många exempel på gratis mallar för ditt CV och ditt brev på Internet men också hos Arbetsförmedlingen som du kan använda för inspiration.\\n\\nI den här inlämningen lämnar du in ditt CV och i filen skall finnas en URL till annonsen och en kopia av annonsen (för säkerhets skull om den hinner tas bort innan ditt ansökningsbrev granskas)\\n\\nKort om utformningen av ditt CV - personlig introduktion i ditt CV eller inte\\n\\nBeroende på","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319609_module_item_id=1004569#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["f950a931-3089-4cb0-a17f-103af4eed67b",{"pageContent":"den här inlämningen lämnar du in ditt CV och i filen skall finnas en URL till annonsen och en kopia av annonsen (för säkerhets skull om den hinner tas bort innan ditt ansökningsbrev granskas)\\n\\nKort om utformningen av ditt CV - personlig introduktion i ditt CV eller inte\\n\\nBeroende på om arbetgivaren vill ha ansökningar som innehåller både ett personligt brev och ett CV eller bara ett CV så kan man utforma sitt CV på lite olika sätt. Anledningen till att en arbetsgivare endast kan vilja ha in ett CV (och inget brev) i en ansökan är att när man söker mer seniora personer så är normalt de erfarenheter man skaffat sig det absolut viktigaste att bedöma. Därför rationaliserar man ibland bort det personliga brevet. I så fall har man ofta en kort personlig introduktion i sitt CV. Så är till exempel de CV-mallar EU använder utformade.\\n\\nMen om man har en ansökan som består av både brev och CV blir det lite tårta på tårta att ha en personlig introduktion både i brevet och sitt CV. Därför ska du inte ha en personlig introduktion i ditt CV i den här uppgiften du ska ha en kort introduktion om vem du är som person i ditt brev.\\n\\nIdag är det vanligast att man skickar in sin ansökan elektroniskt. Därför kan det vara lockande att skriva alla länkar (E-portfölj, utbildningsplan, linkedIn mfl.) som inbäddade länkar eftersom det kan upplevas som snyggare. Men man ska vara medveten om att man i många fall skriver ut intressanta ansökningar på papper för att lättare kunna göra anteckningar,","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319609_module_item_id=1004569#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["f25de00e-39e2-4179-89ff-18312f5a2cbf",{"pageContent":"Därför kan det vara lockande att skriva alla länkar (E-portfölj, utbildningsplan, linkedIn mfl.) som inbäddade länkar eftersom det kan upplevas som snyggare. Men man ska vara medveten om att man i många fall skriver ut intressanta ansökningar på papper för att lättare kunna göra anteckningar, dela med kollegor etc. och då är det en fördel att man skrivit ut länkarna.\\n\\nKomplett postadress - varför ska man ha det? Skickar man in en ansökan i fysisk form kan den användas för att få ansökan returnerad om man inte blir erbjuden tjänsten. För en elektronisk ansökan är det inte relevant, men även i det fallet kan postadressen vara relevant. Ofta gör man andra typer av bakgrundskontroller och då är en komplett postadress relevant för att man ska kunna identifiera rätt person.\\n\\nAtt tänka på (för godkänt):\\n\\nUtforma ditt CV med tanke på vad mottagaren behöver/vill se i ditt CV!\\n\\nUtforma ditt CV så det blir tydligt varför just du är kvalificerad för tjänsten (vilken utbildning/erfarenhet har du, vad kan du bidra med - tänk på det som nämns i artikeln från ACM och från uppgiften om självinventering)\\nHåll ditt CV lagom långt - dvs 1-2 A4 sidor\\nAllt du har med i ditt CV bör du kunna styrka\\nOrganisera ditt CV så att det som är mest relevant för tjänsten du söker är enkelt att hitta - dvs. att det ligger tidigt i ditt CV och at du skriver i omvänd kronologisk ordning med det senaste mest relevanta överst.\\nLägg dina personuppgifter och kontaktuppgifter först\\nFundera på hur du","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319609_module_item_id=1004569#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["8d672675-b191-4dda-81b0-bf97444eda83",{"pageContent":"styrka\\nOrganisera ditt CV så att det som är mest relevant för tjänsten du söker är enkelt att hitta - dvs. att det ligger tidigt i ditt CV och at du skriver i omvänd kronologisk ordning med det senaste mest relevanta överst.\\nLägg dina personuppgifter och kontaktuppgifter först\\nFundera på hur du uttrycker dina styrkor utan att det uppfattas som överdrivet eller skrytsamt\\nFundera på hur långt tillbaka i ditt liv det är relevant att gå för den tjänst du skriver ditt CV för\\nLämna inga luckor i den tidsrymd du täcker i ditt CV utan en förklaring\\nUndvik floskler och överdrifter!\\nSe till att ditt CV är välformulerat, korrekt och rättstavat.\\nFormattera och ge ditt CV:t en prydlig, lättnavigerad layout\\n(en LinkedIn profil är inte samma sak som ett CV eller en E-portfolio - men är något som är riktigt bra att ha)\\nTänk på att läsaren antagligen inte har full kunskap om vad ditt program/utbildning innehåller eller vad en kurskod innebär. Hjälp dem genom att lägga in en länk/adress (om man skriver ut ditt CV på papper) till utbildningsplanen på KTHs webb.\\nLägg in länkar/adresser till din E-portfölj och din LinkedIn-profil\\nLämna in en kopia av annonsen du skriver ditt CV till (antingen som en separat fil (man kan ladda upp flera filer på en gång)- eller som en del av CV filen) Eftersom du ska utforma ditt CV och brev specifikt för tjänsten du söker kan jag inte bedöma och ge dig feedback på dina inlämningar om du inte lämnar in en kopia av annonsen med både ditt brev och ditt","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319609_module_item_id=1004569#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["c00714a9-1df5-4078-8262-cc99e6500061",{"pageContent":"som en separat fil (man kan ladda upp flera filer på en gång)- eller som en del av CV filen) Eftersom du ska utforma ditt CV och brev specifikt för tjänsten du söker kan jag inte bedöma och ge dig feedback på dina inlämningar om du inte lämnar in en kopia av annonsen med både ditt brev och ditt CV.\"","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319609_module_item_id=1004569#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}]],{"0":"7463e62f-a160-45aa-94f9-1e6527d2b7e0","1":"f950a931-3089-4cb0-a17f-103af4eed67b","2":"f25de00e-39e2-4179-89ff-18312f5a2cbf","3":"8d672675-b191-4dda-81b0-bf97444eda83","4":"c00714a9-1df5-4078-8262-cc99e6500061"}]