[[["07386e43-0d78-4651-91bc-f9e8f46cf633",{"pageContent":"\"Aktiv karriärstart - Du i rollen som arbetsgivare\\nNew Attempt\\nDue 31 Jan by 19:00 Points 1 Submitting a file upload File types txt and pdf\\nOm uppgiften\\n\\nFör att få till en lyckad matchning där både den arbetssökande och arbetgivaren blir nöjda så är det viktigt att förstå motparten. Därför bör du när du söker ett jobb försöka sätta dig in i hur arbetsgivaren ser på vem de söker och vad hen ska ha för egenskaper och kvalifikationer.\\n\\nDet är viktigt att du klarar att bortse från vad du svarat i din självinventering så att du inte ser det som svaren på frågorna nedan.  Istället måste du utan förutfattade meningar utgå från vad arbetsgivarperspektivet och vad en arbetsgivare söker. Om du inte gör det kommer du heller inte kunna se vad du eventuellt kan behöva jobba med själv under din tid på utbildningen för att öka dina chanser att få ditt drömjobb.\\n\\nTänk igenom följande frågor och lämna in en pdf med det du kom fram till. Din pdf ska innehålla följande:\\n\\nKopia på annonsen du tänker skriva dina ansökningshandlingar för\\nSvar på frågorna 1-7 (se till att det är tydligt vilken fråga svaret avser)\\n\\nUppgiften bygger på en typ av rollspel (som du kan göra själv, dvs. inte behöver göras i grupp)  där du ska tänka att det är du som äger/ansvarar för det företag eller den del av företaget som har utlyst tjänsten du tänker utforma dina ansökningshandlingar för i den här kursen.\\n\\nDet här är en uppgift där du gärna får diskutera frågorna med dina kurskamrater - men du måste","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319607_module_item_id=1004568#.txt","loc":{"lines":{"from":1,"to":1}}}}],["0c85f965-64e2-4864-83b1-c3697a0d3da9",{"pageContent":"göras i grupp)  där du ska tänka att det är du som äger/ansvarar för det företag eller den del av företaget som har utlyst tjänsten du tänker utforma dina ansökningshandlingar för i den här kursen.\\n\\nDet här är en uppgift där du gärna får diskutera frågorna med dina kurskamrater - men du måste utforma svaren på frågorna som du lämnar in själv! (dvs. ingen kopiering/plagiering)\\n\\nFrågor att reflektera kring\\n\\n1) Att anställa någon är att ta en ekonomisk risk\\n\\nVad krävs för att ekonomin i att anställa någon ska fungera? Prova att göra en enkel uppskattning av kostnaden för att anställa en person med den lön du skulle vilja ha för att ta tjänsten (se till att du har underlag som kan visa att det du begär är en rimlig lön). Beräkna kostnaden så här:\\n\\nÅrskostanden för att anställa personen är:  Årslönekostnad + Overhead\\nÅrslönekostnad: Månadslön * 12 * 1.6    (faktorn 1.6 är kostnader för sociala avgifter t.ex. pension, som företaget betalar)\\nOverhead:  Årslönekostnad* 0.4 (Overheaden inkluderar bland annat: lokalkostnad för personens kontor, dator, telefon, annan utrustning som krävs för jobbet som t.ex. programvarulicenser etc., andel av chefers löner, ekonomiavdelning, HR-avdelning, säljavdelning, m.m.) \\n\\nAntag att du arbetar som konsult och har 70% beläggning - Hur mycket måste företaget du arbetar fakturera kunden per timma för din arbetstid? (Tips: tag först reda på hur många arbestimmar man brukar räkna att en årsarbetstid är)\\n\\nRedovisa: 1) den månadslön du","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319607_module_item_id=1004568#.txt","loc":{"lines":{"from":1,"to":1}}}}],["9df3d819-a1e5-42db-abf4-731572ce5044",{"pageContent":"säljavdelning, m.m.) \\n\\nAntag att du arbetar som konsult och har 70% beläggning - Hur mycket måste företaget du arbetar fakturera kunden per timma för din arbetstid? (Tips: tag först reda på hur många arbestimmar man brukar räkna att en årsarbetstid är)\\n\\nRedovisa: 1) den månadslön du utgår från, 2) vad den totala kostnaden blir som arbetsgivaren måste täcka (Årskostnaden) och 3) vad den fakturerade timkostnaden för din arbetstid skulle bli om du arbetar som konsult. Visa dina beräkningar i detalj - annars är det svårt att kunna ge dig tips om vad du kan behöva ändra om något blivit fel.\\n\\n2) Personliga egenskaper hos den arbetssökande\\n\\na) Vilka personliga egenskaper vill du som arbetsgivare att den du anställer ska ha? Lista de fem viktigaste egenskaperna och ge en kort motivering!\\nb) Vilka personliga egenskaper vill du som arbetgivare inte att den anställde ska ha? Lista minst tre men max fem \\\"dealbreakers\\\" och ge en kort motivering!\\n\\n3) Personliga kunskaper och färdigheter hos den arbetssökande\\n\\na) Vilka generella kunskaper vill du som arbetgivare att den sökande ska ha? Lista de fem viktigaste generella kunskaperna och ge en kort motivering!\\nb) Vilka specifika kunskaper vill du som arbetsgivare att den sökande skall ha? Lista de fem viktigaste specifika kunskaperna och ge en kort motivering!\\n\\n4) Drivkrafter och motivation\\n\\na) Vilka drivkrafter och motivation vill du se hos den sökande? Lista de tre viktigaste drivkrafterna du vill se och ge en kort","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319607_module_item_id=1004568#.txt","loc":{"lines":{"from":1,"to":1}}}}],["7a90d0d2-db6d-42ca-b1d2-23d80ab82fd0",{"pageContent":"kunskaper vill du som arbetsgivare att den sökande skall ha? Lista de fem viktigaste specifika kunskaperna och ge en kort motivering!\\n\\n4) Drivkrafter och motivation\\n\\na) Vilka drivkrafter och motivation vill du se hos den sökande? Lista de tre viktigaste drivkrafterna du vill se och ge en kort motivering!\\nb) Finns det drivkrafter och motivation du helst inte vill se? Lista tre saker du inte vill se och ge en kort motivering!\\n\\n5) Bakgrund och erfarenheter hos den arbetssökande\\n\\na) Vad skulle du vilja se som utbildningsbakgrund och arbetslivserfarenhet hos den sökande? Beskriv vad du vill se!\\nb) Finns det saker som du inte skulle vilja se i den sökandes bakgrund? Beskriv vad du inte vill se!\\nc) Skulle du kunna tänka dig att anställa någon som verkar ha fördomar eller som uppfattar sig utsatt för fördomar? Beskriv hur du tänker! (Mina tankar om fördomar och hur man kan tänka kring dem hittar du längst ner - tjuvkika inte!)\\n\\n6) Ansökningshandlingar och intervju\\n\\na) Vad, förutom det rena faktainnehållet, kan ha en positiv inverkan på hur du skulle uppfatta ansökningshandligarna? Beskriv och ge en kort motivering!\\nb) Vad, förutom det rena faktainnehållet, kan ha en negativ inverkan på hur du skulle uppfatta ansökningshandligarna? Beskriv och ge en kort motivering!\\nc) Vad i det som händer under en anställningsinterju skulle få dig att uppfatta den arbetssökande mer positivt? Beskriv och ge en kort motivering!\\nd) Vad i det som händer under en anställningsinterju","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319607_module_item_id=1004568#.txt","loc":{"lines":{"from":1,"to":1}}}}],["c6ac4aa0-4c03-43af-9ff2-39a2a144ed38",{"pageContent":"inverkan på hur du skulle uppfatta ansökningshandligarna? Beskriv och ge en kort motivering!\\nc) Vad i det som händer under en anställningsinterju skulle få dig att uppfatta den arbetssökande mer positivt? Beskriv och ge en kort motivering!\\nd) Vad i det som händer under en anställningsinterju skulle få dig att uppfatta den arbetssökande mer negativt? Beskriv och ge en kort motivering!\\n\\n7) Är det något du tänker annorlunda på eller skulle vilja ändra i din självinventering när du tänkt på anställningsprocessen ur ett arbetsgivareperspektiv?\\n\\nÄr det något du tänker annorlunda på eller skulle gjort annorlunda i uppgiften om Självinventering när du försökt se anställningsprocessen mer ur ett arbetsgivareperspektiv? Om så vad? Beskriv och förklara varför!\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\nPrevious\\nNext\"","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319607_module_item_id=1004568#.txt","loc":{"lines":{"from":1,"to":1}}}}]],{"0":"07386e43-0d78-4651-91bc-f9e8f46cf633","1":"0c85f965-64e2-4864-83b1-c3697a0d3da9","2":"9df3d819-a1e5-42db-abf4-731572ce5044","3":"7a90d0d2-db6d-42ca-b1d2-23d80ab82fd0","4":"c6ac4aa0-4c03-43af-9ff2-39a2a144ed38"}]