[[["fd6e6c4c-3ffd-4d8d-8bca-bb01c202317f",{"pageContent":"kth.se\nStudent web\nIntranet\nLogin\nSkip to content\nDashboard\nTheodor Wattman\nAccount\nDashboard\nCourses\nGroups\nCalendar\nInbox\nHistory\nHelp\nIV1350 VT25 (60104)PagesSeminar Tasks\n\n2025 VT\nHome\nPiazza\nModules\nAnnouncements\nDiscussions\nQueue For Tutorials\nSoftware\nSeminar Tasks\nAdditional Higher Grade Tasks\nAssignments\nPeople\nGrades1\nCourse Evaluation\nSeminar Tasks\nThe seminars consist of the development of one single object-oriented program, which is reported at five different seminars.\n\n1. Grading Criteria and Requirements for Your Solution\nThe first four seminars concern different activities of object-oriented development. Each of these seminars give 0-2 points, where zero means fail, one means pass and two means pass with distinction. To pass the course you must pass (one or two points) all seminars. To pass a seminar with distinction (2p) gives one higher grade point, which raises the final grade as specified on the page Course Layout . The fifth seminar is an opportunity to re-submit seminars you did not pass or to improve your score for one or more seminars. To pass a seminar, you must solve the specified tasks, submit a report describing your solution, and participate in the discussion during the seminar. It's not required that the solution is correct in all parts or that all statements made at the seminar are correct. More specific grading criteria are specified for each seminar together with the seminar tasks.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":1,"to":36}}}}],["247b3435-9efe-4ee5-b87b-0ff341214da9",{"pageContent":"Design and analysis are always better done in groups than individually, it's therefore strongly recommended that you solve the tasks in groups. You are allowed to create the actual solution in groups of max three students. That is, your solution is allowed to be identical to the solution of at most two other students. You are also allowed to work alone, but that is not recommended. The written report is individual, and may not be written together with any other student.  \n\n2. How to Get Help\nQuestions about the seminar tasks can be asked these ways:\n\nAt tutorials, tutorials exist only to provide help with project tasks. You are welcome to ask about anything related to project work at tutorials.\nIn PiazzaLinks to an external site., don't send direct emails to teachers, instead post questions in Piazza since then all students can be helped by the answers. Mind that posts can be anonymous to other students in Piazza.\n3. Report Template\nAll submitted solutions must follow this template, iv1350-report-template.pdf Download iv1350-report-template.pdf. Note that the template is a pdf file, you must create a similar document. Layout changes are allowed, it's the content that's important. The template pdf is created using latex, if you want to try that you can use the following tex file, iv1350-report-template.tex Download iv1350-report-template.tex, which was used to create the template pdf.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":38,"to":46}}}}],["f6325113-0aab-44c3-bf0c-0a903d95499d",{"pageContent":"4. At the Seminar\nThe seminar is divided into two parts, one for assessing solutions and one for presentation.\n\n4.1 First Part, Assessment\nYou'll be divided into groups of three, each group will assess the solutions of members of one other group. The results of the assessments shall be uploaded to Canvas and emailed to the assessed student. You're not required to bring a printout of your report, but you have to bring your laptop, or some other device you can use to read other student's reports online.\n\n4.2 Second Part, Presentation\nOne randomly chosen student from each group will give a five-minute presentation of their own solution to the entire seminar. The purpose here is not to explain the whole solution, but rather to explain what parts were difficult and why, and if any alternative solutions were considered for those parts. Prepare this presentation before the seminar.\nOne randomly chosen student from the assessing group will give comments, and there will be a brief discussion. Five minutes are allocated for comments and discussion together.\n5. Seminar Tasks\nBelow are seminar tasks and assessment criteria. These criteria will be used to decide the score (0, 1 or 2) of your submitted solution. You'll also use the same criteria during the seminars, where you will, in groups, assess other students' solutions.\n\n5.1 Seminar 1, Analysis\nIn the first seminar you'll create a domain model and a system sequence diagram.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":48,"to":61}}}}],["1ea4eb6f-97c8-4243-b14b-31c92a944a93",{"pageContent":"5.1 Seminar 1, Analysis\nIn the first seminar you'll create a domain model and a system sequence diagram.\n\nHow to Prepare for Seminar 1\nBefore solving this task you have to understand all lectures in module 1, analysis, and read chapter four in the textbook. You may also want to attend exercise 1, which is found in module 1.\n\nWhen to Solve Seminar 1 \nThe required time to solve this task is usually about 20 hours, including lectures and reading. Your are recommended to start working on it as soon as possible at course start, but remember to first do the preparations mentioned above. The deadline for submitting the report is found on the seminar 1 assignment page.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":60,"to":67}}}}],["4dc0d586-c8a0-4ee6-ad65-3b91233f05a4",{"pageContent":"Intended Learning Outcomes for Seminar 1 \nInterpret and clarify a given specification by applying established guidelines for analysis.\nTask for Seminar 1 \nHere are the seminar tasks, tasks-seminar1.pdf Download tasks-seminar1.pdf. You shall submit solutions under the assignment Seminar 1, Analysis.\nHere are the assessment criteria, assessment-criteria-seminar1.pdf Download assessment-criteria-seminar1.pdf. These criteria are used in the following three different ways.\nBy yourself, when you evaluate your solution in the discussion chapter of your report.\nBy your group at the seminar, when you assess other students' solutions and submit your assessment under the assignment Peer Assessment DURING Seminar 1.\nBy the teacher, when grading your report.\n5.2 Seminar 2, Design\nIn the second seminar you'll design the system under development.\n\nHow to Prepare for Seminar 2\nBefore solving this task you have to understand all lectures in module 2, design, and read chapter five in the textbook. You may also want to attend exercise 2, which is found in module 2.\n\nWhen to Solve Seminar 2\nThe required time to solve this task is usually about 25 hours, including lectures and reading. Your are recommended to start working on it as soon as possible after seminar 1, but remember to first do the preparations mentioned above. The deadline for submitting the report is found on the seminar 2 assignment page.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":69,"to":84}}}}],["34a98fe8-5a55-41ff-9036-85110bc12eff",{"pageContent":"Intended Learning Outcomes for Seminar 2\nDevelop an object-oriented program by applying established guidelines for object-oriented architecture, design and programming.\nDiscuss the quality of a program and then refer to established guidelines for object-oriented architecture, design and programming.\nTask for Seminar 2\nHere are the seminar tasks, tasks-seminar2.pdf Download tasks-seminar2.pdf. You shall submit solutions under the assignment Seminar 2, Design.\nHere are the assessment criteria, assessment-criteria-seminar2.pdf Download assessment-criteria-seminar2.pdf. These criteria are used in the following three different ways.\nBy yourself, when you evaluate your solution in the discussion chapter of your report.\nBy your group at the seminar, when you assess other students' solutions and submit your assessment under the assignment Peer Assessment DURING Seminar 2.\nBy the teacher, when grading your report.\n5.3 Seminar 3, Implementation\nIn the third seminar you'll program and test the system under development.\n\nHow to Prepare for Seminar 3\nBefore solving this task you have to understand all lectures in module 3, implementation and testing, and read chapters six and seven in the textbook. You may also want to attend exercise 3, which is found in module 3.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":86,"to":99}}}}],["2a67a6c3-7a53-414a-bec9-712a1f07860d",{"pageContent":"How to Prepare for Seminar 3\nBefore solving this task you have to understand all lectures in module 3, implementation and testing, and read chapters six and seven in the textbook. You may also want to attend exercise 3, which is found in module 3.\n\nWhen to Solve Seminar 3\nThe required time to solve this task is usually about 30 hours, including lectures and reading. Your are recommended to start working on it as soon as possible after seminar 2, but remember to first do the preparations mentioned above. The deadline for submitting the report is found on the seminar 3 assignment page.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":98,"to":102}}}}],["46514b16-b793-4126-a062-6c38f18e2255",{"pageContent":"Intended Learning Outcomes for Seminar 3\nDevelop an object-oriented program by applying established guidelines for object-oriented architecture, design and programming.\nDiscuss the quality of a program and then refer to established guidelines for object-oriented architecture, design and programming.\nTask for Seminar 3\nHere are the seminar tasks, tasks-seminar3.pdf Download tasks-seminar3.pdf. You shall submit solutions under the assignment Seminar 3, Implementation.\nHere are the assessment criteria, assessment-criteria-seminar3.pdf Download assessment-criteria-seminar3.pdf. These criteria are used in the following three different ways.\nBy yourself, when you evaluate your solution in the discussion chapter of your report.\nBy your group at the seminar, when you assess other students' solutions and submit your assessment under the assignment Peer Assessment DURING Seminar 3.\nBy the teacher, when grading your report.\n5.4 Seminar 4, Exceptions and Design Patterns\nIn the fourth seminar you'll implement exception handling, and also use design patterns.\n\nHow to Prepare for Seminar 4\nBefore solving this task you have to understand all lectures in module 4, exceptions and design patterns, and read chapters 8, 9.1, 9.2 and 9.4 except the pattern Template Method. You may also want to attend exercise 4, which is found in module 4.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":104,"to":117}}}}],["fe940767-e2fd-4913-839f-6c8a7fcdf4f6",{"pageContent":"How to Prepare for Seminar 4\nBefore solving this task you have to understand all lectures in module 4, exceptions and design patterns, and read chapters 8, 9.1, 9.2 and 9.4 except the pattern Template Method. You may also want to attend exercise 4, which is found in module 4.\n\nWhen to Solve Seminar 4\nThe required time to solve this task is usually about 25 hours, including lectures and reading. Your are recommended to start working on it as soon as possible after seminar 3, but remember to first do the preparations mentioned above. The deadline for submitting the report is found on the seminar 4 assignment page.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":116,"to":120}}}}],["d9d1d677-7a36-43eb-81c2-02523169f990",{"pageContent":"Intended Learning Outcomes for Seminar 4\nDevelop an object-oriented program by applying established guidelines for object-oriented architecture, design and programming.\nDiscuss the quality of a program and then refer to established guidelines for object-oriented architecture, design and programming.\nTask for Seminar 4\nHere are the seminar tasks, tasks-seminar4.pdf Download tasks-seminar4.pdf. You shall submit solutions under the assignment Seminar 4, Exceptions and Design Patterns.\nHere are the assessment criteria, assessment-criteria-seminar4.pdf Download assessment-criteria-seminar4.pdf. These criteria are used in the following three different ways.\nBy yourself, when you evaluate your solution in the discussion chapter of your report.\nBy your group at the seminar, when you assess other students' solutions and submit your assessment under the assignment Peer Assessment DURING Seminar 4.\nBy the teacher, when grading your report.\n 5.5 Seminar 5, Improve Your Score\nThe fifth seminar is an opportunity to re-submit seminars you did not pass or to improve your score from one to two for one or more seminars.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":122,"to":132}}}}],["54c7715a-fce2-470a-9b3b-738e00a934e1",{"pageContent":"How to Submit Seminar 5\nSubmit an updated report under the assignment Seminar 5, Improve Your Score. Clearly explain what you have changed.\nSubmit one file per seminar you want to improve.\nAt Seminar 5\nIf you resubmit a task you have presented at a previous seminar, you do not have to attend the corresponding seminar five session.\nIf you have not attended the ordinary seminar, you must attend the corresponding seminar five session, do the peer assessment task, and submit your assessment under the assignment Peer Assessment DURING Seminar 5.","metadata":{"source":"OpenAI/documents/Seminar.txt","loc":{"lines":{"from":134,"to":139}}}}]],{"0":"fd6e6c4c-3ffd-4d8d-8bca-bb01c202317f","1":"247b3435-9efe-4ee5-b87b-0ff341214da9","2":"f6325113-0aab-44c3-bf0c-0a903d95499d","3":"1ea4eb6f-97c8-4243-b14b-31c92a944a93","4":"4dc0d586-c8a0-4ee6-ad65-3b91233f05a4","5":"34a98fe8-5a55-41ff-9036-85110bc12eff","6":"2a67a6c3-7a53-414a-bec9-712a1f07860d","7":"46514b16-b793-4126-a062-6c38f18e2255","8":"fe940767-e2fd-4913-839f-6c8a7fcdf4f6","9":"d9d1d677-7a36-43eb-81c2-02523169f990","10":"54c7715a-fce2-470a-9b3b-738e00a934e1"}]