[[["d3f18170-c2fa-4733-a0a3-e0bb7fec4b8e",{"pageContent":"\"Aktiv karriärstart – E-portfolio\\nNew Attempt\\nDue 14 Feb by 19:00 Points 1 Submitting a website url\\nOm uppgiften\\n\\nSpeciellt om man går vidare i en ansökningsprocess vill arbetsgivaren ofta se vad man kan göra konkret. För det ändamålet är det bra att ha en E-portfolio. En E-portfolio är en sida/resurs på  webben som skall innehålla konkreta exempel på vad du gjort (dvs. för arbetsgivaren visar det konkret vad du kan förväntas prestera om du får tjänsten). En E-portolio kan t.ex. byggas upp i Social, github mfl. (En LinkedIn profil är normalt att betrakta som ett CV - dvs. inte en E-portfolio)\\n\\nNär du bygger upp den tänk på:\\n\\ndet ska vara enkelt att se vems E-portfolio man hittat till (skriv ut ditt namn och en kort bskrivning om vem du är)\\natt den bör vara lätta att navigera i och förstå även för en utomstående (det är lätt att utgå från antagandet att läsaren också vet vad man själv vet om vad som finns i den -  det blir ofta fel)\\nska innehålla sådant som är relevant för tjänsten\\nska bara innehålla sådant man själv kan stå för\\ninte innehålla sådant som andra har äganderätt till (och som då skulle kunna kopieras/spridas)\\n\\nDu bör också fundera på om du vill ha den helt publik eller om du vill skydda delar från åtkomst. Till exempel bör du inte ha lösningar till examinationsmoment i andra kurser publika då det kan utgöra \\\"otillbörligt samarbete\\\" att låta andra ta del av sådana lösningar för sin egen examination.\\n\\nProjektet du gör i åk2 P4 kan vara en bra","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319610_module_item_id=1004571.txt","loc":{"lines":{"from":1,"to":1}}}}],["29236e40-56d6-498c-866d-d2a96f7ba6a5",{"pageContent":"helt publik eller om du vill skydda delar från åtkomst. Till exempel bör du inte ha lösningar till examinationsmoment i andra kurser publika då det kan utgöra \\\"otillbörligt samarbete\\\" att låta andra ta del av sådana lösningar för sin egen examination.\\n\\nProjektet du gör i åk2 P4 kan vara en bra startpunkt att bygga upp sin E-portfolio från.\\n\\nExempel på hur man kan använda/jobba med E-portfolios\\n\\nPå många universitet runt om i världen jobbar man aktivt med E-portfolios. I många fall är de betydligt mer avancerade än vad som krävs för att bli godkänd i den här kursen. I den här kursen så räcker det att skapa ett empbryo att bygga vidare på men som ändå innehåller allt som gör det till en E-portfolio. Ett bra exempel på hur man jobbar med E-portfolios och där man gör betydligt mer avancerade än vad den här kursen kräver hittar du här: https://www.youtube.com/watch?v=3n8UG3YOOFU\\n\\nInlämning\\n\\nLämna in en länk till din E-portfolio. Din E-portfolio skall för den här uppgiften vara publik - dvs. den skall gå att komma åt utan att man behöver ansluta sig till eller logga in i någon specifik tjänst för att kunna nå den.\\n\\nObs! En sida i LinkedIn är inte automatiskt en E-portfolio om den inte innehåller konkreta exempel på vad du gjort.\"","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319610_module_item_id=1004571.txt","loc":{"lines":{"from":1,"to":1}}}}]],{"0":"d3f18170-c2fa-4733-a0a3-e0bb7fec4b8e","1":"29236e40-56d6-498c-866d-d2a96f7ba6a5"}]