[[["fd130a2e-3f09-455d-b3c8-b872b60a76c5",{"pageContent":"\"Aktiv karriärstart – Självinventering\\nNew Attempt\\nDue 24 Jan by 19:00 Points 1 Submitting a file upload File types pdf\\nOm uppgiften\\n\\nI den här uppgiften ska du arbeta med en självinventering men också kamratbedömningar av era brev och CV. Det är en uppgift du skall vara beredd på att du behöver ägna en hel del eftertanke och omsorg om - eller uttryckt på annat sätt det är inget man gör på en eftermiddag.\\n\\nFör att kunna skriva bra ansökningsbrev, skapa ett bra CV eller prestera bra i en anställningsintervju behöver man känna sig själv. Det är också viktigt att man är ärlig i de här sammanhangen. För en arbetsgivare är det naturligtvis avgörande att den man tror sig anställa faktiskt är den man anställer. Det är inte helt ovanligt att sökanden överdriver i sina ansökningsbrev och CV:n - något man naturligtvis bör undvika. Att vara medveten om vad som kan uppfattas som varningssignaler för en arbetsgivare och kunna undvika dem är bra att känna till.\\n\\nFör en arbetsgivare är det en stor kostnad att anställa någon. En ingenjör kostar minst en miljon kronor om året att ha anställd. Det är heller inte så lätt att säga upp någon för bristande kompetens, varken rent arbetsrättsligt eller för att det kan orsaka oro i organisationen.\\n\\nEn attraktiv tjänst kan locka många sökanden.  Att man kan få in hundratals ansökningar är inte ovanligt. I anställningsprocessen så granskar man därför oftast ansökningarna översiktligt och väljer ut ett antal som står ut i mängden och verkar","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319611_module_item_id=1004567#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["88459e01-70e1-448d-b660-1d0eb0f9cf26",{"pageContent":"eller för att det kan orsaka oro i organisationen.\\n\\nEn attraktiv tjänst kan locka många sökanden.  Att man kan få in hundratals ansökningar är inte ovanligt. I anställningsprocessen så granskar man därför oftast ansökningarna översiktligt och väljer ut ett antal som står ut i mängden och verkar matcha den profil man söker bra. Ansökningar som inte matchar profilen eller som verkar vara överdrivna/skrytsamma rensas normalt ut direkt.\\n\\nNästa steg är att granska de utvalda ansökningarna mer noga - bland annat för att upptäcka eventuella lögner/överdrifter (som man också kan leta efter i intervjusituationer).\\n\\nLäs igenom: http://www.bbc.com/capital/story/20170411-how-to-catch-the-lying-job-applicants-and-what-to-do-next\\n\\nDe vars ansökningar passerar granskningen kallas sedan ofta (ibland kallar man bara någon/några av de man tycker är bäst och håller resten som en reserv)  till en eller flera intervjuer. För nyutexaminerade ingenjörer, som ännu inte hunnit skaffa sig en solid uppsättning relevanta referenser, väntar ofta också praktiska prov som en del av anställningsprocessen.\\n\\nLäs igenom: https://cacm.acm.org/blogs/blog-cacm/242740-talented-programmers-dont-tolerate-chaos/fulltext\\n\\n \\n\\n\\\"I have an interview with Google soon and the content they gave me to study is literally the same as this course [ID1020].\\\"\\n\\n\\nKommentar i kursenkät ht19\\n\\n \\n\\nEn slutsats man kan dra av det här är att det första steget mot att klara sig bra i anställningsprocesser är att lära","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319611_module_item_id=1004567#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["6c9416da-8fd4-4095-b79b-ff98a0f21b4b",{"pageContent":"have an interview with Google soon and the content they gave me to study is literally the same as this course [ID1020].\\\"\\n\\n\\nKommentar i kursenkät ht19\\n\\n \\n\\nEn slutsats man kan dra av det här är att det första steget mot att klara sig bra i anställningsprocesser är att lära känna sig själv, vad man vill, vad man är bra på, vilka brister man har och förstå hur andra uppfattar en.\\n\\nDet första momentet i kursen är därför att du jobbar igenom och lämnar in en självinventering där du också hittar tips på hur du skriver ditt CV och anställningsbrev. I självinventeringen finns uppgifter där ni studenter ska hjälpa varandra att göra en första granskning av era CV och ansökningsbrev. Det ni ska granska där och skriva om i självinventeringen är era utkast till de CV och brev ni skriver i kursen. Era CV och brev skall vara kompletta men inte nödvändigtvis helt färdig polerade.\\n\\nOBS! Du måste göra samtliga uppgifter i självinventeringen på ett seriöst sätt för att bli godkänd.\\n\\nTill exempel innebär det att det för uppgifter där du skall markera saker ska det finnas markeringar (eller en lista), ska du ange ett antal saker där du skall förtydliga dig krävs minst tre svar. \\nFör intervjuerna som handlar om hur andra uppfattar dig så accepterar vi inte mer än en intervju med närstående/barndomsvänner. De personerna känner dig i ett sammanhang men för uppgiften handlar det mer om hur du uppfattas i sammanhanget av att vara ingenjör/studera till ingenjör.\\nFör intervjun med en","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319611_module_item_id=1004567#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}],["8df7cf95-7ba4-402d-ba00-84d36c9a7b7e",{"pageContent":"som handlar om hur andra uppfattar dig så accepterar vi inte mer än en intervju med närstående/barndomsvänner. De personerna känner dig i ett sammanhang men för uppgiften handlar det mer om hur du uppfattas i sammanhanget av att vara ingenjör/studera till ingenjör.\\nFör intervjun med en ingenjör så gäller samma sak att den inte ska vara utförd med någon närstående (som du ändå vet vad den gör på jobbet). Personen skall ha ett jobb och bakgrund inom området du utbildar dig för. Du ska ange namn, utbildningsbakgrund, tjänst och företag för personen.\\nFör uppgifterna som handlar om granskning av CV, brev och rollspelsövningarna om anställningsintervju så ska du samarbeta med studenter som läser kursen samtidigt som du gör det. Du ska ange i din inlämning vilka personer du samarbetat med för respektive uppgift.\\n\\nInlämningen görs som pdf.\"","metadata":{"source":"database/f4e76cf3-20d9-4ce7-8710-af40b085ad86/II1307/context/files/canvas.kth.se_courses_52615_assignments_319611_module_item_id=1004567#submit_online_upload_form.txt","loc":{"lines":{"from":1,"to":1}}}}]],{"0":"fd130a2e-3f09-455d-b3c8-b872b60a76c5","1":"88459e01-70e1-448d-b660-1d0eb0f9cf26","2":"6c9416da-8fd4-4095-b79b-ff98a0f21b4b","3":"8df7cf95-7ba4-402d-ba00-84d36c9a7b7e"}]