[[["3177ec87-7d3e-4ccd-a254-e1edc6722ec6",{"pageContent":"Sida\n1\nav 2\nObject-Oriented Design, IV1350 Seminar 2, Design\nSeminar 2, Design\nObject-Oriented Design, IV1350\nIntended Learning Outcomes\nThis seminar concerns the learning outcomes develop an object-oriented program by ap-\nplying established guidelines for object-oriented architecture and design and discuss the\nquality of a program referring to established guidelines for object-oriented architecture\nand design.\nGoal\n Practice basic object-oriented design\nLiterature\n Chapter five in A First Course in Object Oriented Development.\nGrading\nThere are three possible grades:\nFail (0 points) To pass the course you must pass all four seminars. If you fail this\nseminar you have to report it again at the end of the course, at the fifth seminar.\n1 point Active participation in seminar discussions. Written solution submitted in Can-\nvas proving that you can, with minor defects, follow a method for designing an\nobject-oriented program.\n2 points Active participation in seminar discussions. Written solution submitted in\nCanvas proving that you can, without defects, use cohesion, coupling and encap-\nsulation to design an object-oriented program. In the written solution you must\nalso motivate how these principles are used.\n1 (2)\nObject-Oriented Design, IV1350 Seminar 2, Design\nTask\nDesign a program that can handle all parts, including alternative flows, of the Process\nSale scenario, specified in the document with tasks for seminar one. Remember to also","metadata":{"source":"OpenAI/documents/pdf.txt","loc":{"lines":{"from":2,"to":32}}}}],["11ab4513-6aeb-4971-8da0-e134d0c14fe0",{"pageContent":"also motivate how these principles are used.\n1 (2)\nObject-Oriented Design, IV1350 Seminar 2, Design\nTask\nDesign a program that can handle all parts, including alternative flows, of the Process\nSale scenario, specified in the document with tasks for seminar one. Remember to also\ndesign the startup, that is, the main method. The task is only to design the program,\nyou’re not required to write any code and you shall not include any code in the report.\nStill, if you find designing hard, it’s a god idea to code some part of it. The meaning of\nthe diagrams becomes much clearer when implemented in code.\nThe solution must meet the following requirements.\n The design must have high cohesion, low coupling and good encapsulation with a\nwell-designed public interface.\n The solution must be divided into layers, as specified by the MVC and Layer\npatterns.\n You are not required to follow the domain model and system sequence diagram\nyou made for seminar one; you may change them now if you find flaws in them.\nHowever, do keep your existing analysis model (DM and SSD) unless there are\nobvious reasons to change it.\n You do not have to design the view, it can be replaced with a class called View.\n You do not have to design the data layer, it can be omitted.\n In the Method chapter of your report, explain how you worked and give examples\nof how you reasoned when creating the design.\n In the Result chapter of your report, include and briefly explain interaction dia-","metadata":{"source":"OpenAI/documents/pdf.txt","loc":{"lines":{"from":27,"to":50}}}}],["68ed281b-c209-42ca-aaf9-71210ced1531",{"pageContent":" You do not have to design the data layer, it can be omitted.\n In the Method chapter of your report, explain how you worked and give examples\nof how you reasoned when creating the design.\n In the Result chapter of your report, include and briefly explain interaction dia-\ngram(s) (that is, either communication or sequence diagrams) of the entire design.\nThere must be interaction diagram(s) describing all functionality of the Process\nSale scenario, both the basic and alternative flows, and also the main method. The\nchapter must also contain, and briefly explain, a class diagram showing all classes\nin the interaction diagram(s).\n In the Discussion chapter of your report, evaluate your design using applicable\nassessment criteria from the document assessment-criteria-seminar2.pdf, which\nis available on the Seminar Tasks page in Canvas.\nAs a preparation for seminar three, which takes a lot of time to solve, it’s certainly a\ngood idea to already now think about how the methods you design can be implemented\nand tested. This is however just an advice, not a requirement, and shall not be covered\nin the report.\n2 (2)","metadata":{"source":"OpenAI/documents/pdf.txt","loc":{"lines":{"from":47,"to":63}}}}]],{"0":"3177ec87-7d3e-4ccd-a254-e1edc6722ec6","1":"11ab4513-6aeb-4971-8da0-e134d0c14fe0","2":"68ed281b-c209-42ca-aaf9-71210ced1531"}]