[[["988f30ab-2432-4428-8087-a87c19c807d7",{"pageContent":"kth.se\nStudent web\nIntranet\nLogin\nSkip to content\nDashboard\nTheodor Wattman\nAccount\nDashboard\nCourses\nGroups\nCalendar\nInbox\nHistory\nHelp\nIV1350 VT25 (60104)PagesSoftware\n\n2025 VT\nHome\nPiazza\nModules\nAnnouncements\nDiscussions\nQueue For Tutorials\nSoftware\nSeminar Tasks\nAdditional Higher Grade Tasks\nAssignments\nPeople\nGrades1\nCourse Evaluation\nSoftware\nHere are links to programs that are useful for the course.\n\n1. UML Editors\nYou must use a UML editor for diagrams in seminar reports, all editors below have enough functionality. Astah is the UML editor that will be used for examples during lectures.\n\nAstah\nAstahLinks to an external site. is made for UML diagrams, and understands the meaning of the diagram that is created. This means it will make sure your diagram has correct UML syntax. On the other hand, it might be hard to make the diagram look like you wish, and you will only be able to use the parts of UML that are implemented in Astah.\n\nAll participants in the course are entitled to a license for astah professional, which can be found at the page Astah License .  You may also use the free student edition of astah professional, but avoid the limited time trial editions.\n\nAstah is currently only working with JDK 21, but that does not create any problem for Windows or Mac users, since the correct JDK is included in the installer. Linux users are forced to handle this problem manually.\n\nAstah is used for all diagrams in the course literature, and will be used at lectures.","metadata":{"source":"OpenAI/documents/Software.txt","loc":{"lines":{"from":1,"to":45}}}}],["65c994ab-9dc7-4a45-8277-e64f07c48f0f",{"pageContent":"Astah is used for all diagrams in the course literature, and will be used at lectures.\n\nThere is a user guide at http://astah.net/manualLinks to an external site.\n\nHere are videos that show how to create class and sequence diagrams:\n\n3 min lectures for your daily modeling - (1) Fundamental UML Class DiagramLinks to an external site.\n3 min lectures for your daily modeling - (2) Fundamental UML Sequence DiagramLinks to an external site.\n3 TIPS to create UML Class Diagrams fastLinks to an external site.\nLucidchart\nLucidchartLinks to an external site. is a drawing program that does not understand UML diagrams. This means you're practically always able to draw the diagram you wish, but it is up to you to make sure the UML is correct. There are predefined UML symbols, though not as many as in Astah.\n\nLucidchart is web based, no installation is required. We don't have a license, but there's a free version. It's however limited to only three documents.\n\nPlantUML\nPlantUMLLinks to an external site. is a drawing program that does not understand UML diagrams. This means you're practically always able to draw the diagram you wish, but it is up to you to make sure the UML is correct. There's no GUI, the diagrams are created in a text language, and then compiled to images.\n\nPlantUML is opensource and free of charge. \n\n2. Programming\nThe course contains quite a lot of programming. It's strongly recommended that you use an IDE, e.g. IntelliJ, Visual Studio Code, NetBeans or Eclipse.","metadata":{"source":"OpenAI/documents/Software.txt","loc":{"lines":{"from":45,"to":65}}}}],["becad2a0-af63-4dff-a09b-25c3516db564",{"pageContent":"PlantUML is opensource and free of charge. \n\n2. Programming\nThe course contains quite a lot of programming. It's strongly recommended that you use an IDE, e.g. IntelliJ, Visual Studio Code, NetBeans or Eclipse.\n\nNetBeans\nhttps://netbeans.apache.org/Links to an external site. NetBeans will be used for all examples at the lectures, but you're free to choose any IDE.\n\n3. LaTeX Editors\nIt is perfectly fine to write solutions for seminar tasks with word, but in case you want to try LaTeX, some free LaTeX editors are listed here.\n\nKile\nhttp://kile.sourceforge.net/Links to an external site. Kile is originally made for Linux, but there's a Windows version as well. All course pdf documents in the course were created with Kile.\n\nOverleaf\nhttps://www.overleaf.com/Links to an external site. Overleaf is an online LaTeX editor, which has a free version.","metadata":{"source":"OpenAI/documents/Software.txt","loc":{"lines":{"from":62,"to":77}}}}]],{"0":"988f30ab-2432-4428-8087-a87c19c807d7","1":"65c994ab-9dc7-4a45-8277-e64f07c48f0f","2":"becad2a0-af63-4dff-a09b-25c3516db564"}]